In [43]:
import pandas as pd
import numpy as np

nba = pd.read_csv("nba.csv", parse_dates=["Birthday"])

C:\Users\armen\AppData\Local\Temp\ipykernel_20240\871009900.py:4: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  nba = pd.read_csv("nba.csv", parse_dates=["Birthday"])

In [18]:
city = {
    "City": ["New York City", "Paris", "Barcelona", "Rome"],
    "Country":["United States", "France", "Spain", "Italy"],
    "Population": [8600000, 2141000, 5515000, 2873000],
}

cities = pd.DataFrame(city)
cities.transpose()
cities.T

                        0        1          2        3
City        New York City    Paris  Barcelona     Rome
Country     United States   France      Spain    Italy
Population        8600000  2141000    5515000  2873000

In [21]:
random_data = np.random.randint(1,101,[3,5])

    0   1   2   3   4
0  62  37  32  74  18
1  31  54  30  34  96
2  96  13   1  10  71

In [37]:
row_labels = ["Morning", "Afternoon", "Evening"]
pd.DataFrame(random_data, index=row_labels)

            0   1   2   3   4
Morning    62  37  32  74  18
Afternoon  31  54  30  34  96
Evening    96  13   1  10  71

In [35]:
column_labels = ("Monday", "Tuesday", "Wednesday", "Thursday", "Friday")

pd.DataFrame(random_data, index=row_labels, columns=column_labels)

           Monday  Tuesday  Wednesday  Thursday  Friday
Morning        62       37         32        74      18
Afternoon      31       54         30        34      96
Evening        96       13          1        10      71

In [39]:
row_labels = ["Morning", "Afternoon", "Morning"]
column_labels = ("Monday", "Tuesday", "Wednesday", "Tuesday", "Friday")

pd.DataFrame(random_data, index=row_labels, columns=column_labels)

           Monday  Tuesday  Wednesday  Tuesday  Friday
Morning        62       37         32       74      18
Afternoon      31       54         30       34      96
Morning        96       13          1       10      71

In [47]:
nba.dtypes.value_counts()

object            3
datetime64[ns]    1
int64             1
Name: count, dtype: int64

In [49]:
nba

               Name                 Team Position   Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF 1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG 1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26     79568
..              ...                  ...      ...        ...       ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 5 columns]

In [50]:
nba.index

RangeIndex(start=0, stop=450, step=1)

In [51]:
nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [52]:
nba.ndim

2

In [53]:
nba.shape

(450, 5)

In [54]:
nba.size

2250

In [56]:
nba.count()

Name        450
Team        450
Position    450
Birthday    450
Salary      450
dtype: int64